nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/driver_examples/eqdc/pin_mux.h
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC3 (number 7), U12[7]
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC2 (number 5), U12[6]
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE7 (number 54), J3[3]/J18[2]/SW3
  @{ */
#define BOARD_BUTTON_SW3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_BUTTON_SW3_PIN 7U              /*!<@brief GPIOE pin index: 7 */
#define BOARD_BUTTON_SW3_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOF1 (number 50), J3[1]/ENC_B
  @{ */
#define BOARD_ENC_B_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_ENC_B_PIN 1U              /*!<@brief GPIOF pin index: 1 */
#define BOARD_ENC_B_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC6 (number 31), J1[3]
  @{ */
#define BOARD_ENC_I_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_ENC_I_PIN 6U              /*!<@brief GPIOC pin index: 6 */
#define BOARD_ENC_I_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC7 (number 32), J1[14]/U13[1]/SS0
  @{ */
#define BOARD_SS0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SS0_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define BOARD_SS0_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
